src/Catalogs/уатСопроводительныеДокументы/уатСопроводительныеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатСопроводительныеДокументы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.уатВидыСопроводительныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВладельца</name>
    <type>
      <types>EnumRef.уатВидыВладельцевСопроводительныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецДокумента</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОснования</name>
    <type>
      <types>EnumRef.уатВидыОснованийСопроводительныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.уатМаршрутныйЛист</types>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЭкземпляров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПунктНазначения</name>
    <type>
      <types>CatalogRef.уатПунктыНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОбработкиВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОбработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиУведомлений</name>
    <attributes>
      <name>ВидУведомления</name>
      <type>
        <types>CatalogRef.уатСпособыВзаимодействий_уэ</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Контрагенты</types>
        <types>String</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПолучателя</name>
      <type>
        <types>EnumRef.уатТипыПолучателейУведомлений_уэ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПосылатьУведомления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/уатДатыОбработкиДокументов/уатДатыОбработкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатДатыОбработкиДокументов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПлановаяДатаОбработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДнейНаОбработку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СопроводительныйДокумент</name>
    <type>
      <types>CatalogRef.уатСопроводительныеДокументы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/уатВидыВладельцевСопроводительныхДокументов/уатВидыВладельцевСопроводительныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыВладельцевСопроводительныхДокументов</name>
  <enumValues>
    <name>ДокументыОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ДокументыПеревозчика</name>
  </enumValues>
  <enumValues>
    <name>ДокументыЗаказчика</name>
  </enumValues>
  <enumValues>
    <name>ОбщиеДокументы</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/уатСопроводительныеДокументы/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проброс флага создания нового элемента в обработчик ПриЗаписи() для установки статуса
	Если НЕ ЭтоГруппа И Ссылка.Пустая() Тогда
		ДополнительныеСвойства.Вставить("НовыйЭлемент", Истина);
	КонецЕсли;
	
	// Уведомления
	Если НЕ Отказ 
		И НЕ ПометкаУдаления
		И НЕ ЭтоГруппа
		И ПолучитьФункциональнуюОпцию("уатИспользоватьУведомления_уэ") Тогда
		// Заполнение ТЧ "Получатели уведомлений"
		Если Модифицированность() Тогда
			тблПолучатели = уатОбщегоНазначения_уэ.СформироватьСписокПолучателейУведомлений(ЭтотОбъект);
			ПолучателиУведомлений.Загрузить(тблПолучатели);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// если новый - запускаем установку статуса автоматом
	Если НЕ ЭтоГруппа И НЕ Шаблон Тогда
		Если ДополнительныеСвойства.Свойство("НовыйЭлемент") Тогда
			Справочники.уатСопроводительныеДокументы.УстановитьСтатусДокумента(Ссылка);
		КонецЕсли;
		СкорректироватьРучнуюДатуОбработки();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЭтоГруппа И НЕ Шаблон
		И ВидДокумента.ВидВладельца = Перечисления.уатВидыВладельцевСопроводительныхДокументов.ДокументыЗаказчика Тогда
		
		ПроверяемыеРеквизиты.Добавить("ВладелецДокумента");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура СкорректироватьРучнуюДатуОбработки()
	
	Если НЕ ПлановаяДатаОбработкиВручную
		ИЛИ НЕ ЗначениеЗаполнено(ПлановаяДатаОбработки)
		ИЛИ НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	НЗДатыОбработки = РегистрыСведений.уатДатыОбработкиДокументов.СоздатьНаборЗаписей();
	НЗДатыОбработки.Отбор.Регистратор.Установить(Основание);
	НЗДатыОбработки.Прочитать();
	
	тблНЗ = НЗДатыОбработки.Выгрузить();
	мсвСтрокСД = тблНЗ.НайтиСтроки(Новый Структура("СопроводительныйДокумент", Ссылка));
	Для Каждого ТекСтрокаУдалить Из мсвСтрокСД Цикл
		тблНЗ.Удалить(ТекСтрокаУдалить);
	КонецЦикла;
		
	СтруктураДополнительныеСвойства = Новый Структура;
	СтруктураДополнительныеСвойства.Вставить("СопроводительныйДокумент", Ссылка);
	СтруктураДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый Структура);
	уатПроведение_проф.СформироватьТаблицуДатыОбработкиДокументов(Основание, СтруктураДополнительныеСвойства);
	
	Если СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаДатыОбработкиДокументов") Тогда
		Для Каждого ТекСтрока Из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДатыОбработкиДокументов Цикл
			НоваяЗапись = тблНЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока);
			НоваяЗапись.Активность = Истина;
		КонецЦикла;
	КонецЕсли;
	
	НЗДатыОбработки.Загрузить(тблНЗ);
	НЗДатыОбработки.Записать();
	
КонецПроцедуры

#КонецОбласти
